TrainBookingWS/request.old

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCountryRequest>
         <gs:name>Spain</gs:name>
      </gs:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>

curl --header "content-type: text/xml" -d @request.xml http://localhost:8181/train-booking/ws
curl --header "content-type: text/xml" -d @TrainBookingWS/signup.xml http://localhost:8181/train-booking/ws



        MessageDigest hashFunc;
        try {
            hashFunc = MessageDigest.getInstance("SHA-256");
            hashFunc.update(password.getBytes());
            this.password = new String(hashFunc.digest());
        } catch (NoSuchAlgorithmException e) {
            this.password = ""+password.hashCode();
        }


docker build -f Dockerfile.client.java-mvn . -t ws_soap_rest-java-client

docker run --network=host -it ws_soap_rest-java-client java -jar client-app.jar
