complete/secure-request.xml

<soap:Envelope xmlns:gs="http://spring.io/guides/gs-producing-web-service" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:id="UsernameToken-1">
                <wsse:Username>user</wsse:Username>
                <wsse:Password>pass</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MTQyNDA2NzkzNTg1OA==</wsse:Nonce>
                <!-- http://www.timeanddate.com/worldclock/timezone/zulu -->
                <wsu:Created>2016-01-28T18:21:00Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
	<gs:getCountryRequest><gs:name>Spain</gs:name></gs:getCountryRequest>
    </soap:Body>
</soap:Envelope>
